{
  "backend/main.mo": "Minimal Motoko canister defining an empty actor.",
  "feature_evidence.json": "Feature evidence report listing two ZIP-download-related features with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend files and components.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables, dark mode variants, and global background/foreground styling.",
  "frontend/index.html": "Base HTML document that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering the LandingPage.",
  "frontend/src/components/landing/components/AnchorProtocol.tsx": "Component explaining the three-step Anchor Protocol with two example corrections and anchor statements.",
  "frontend/src/components/landing/components/PatternInterruptGraphic.tsx": "Displays a static Pattern Interrupt image illustrating the WEAK-END to FAMILY-TIME swap.",
  "frontend/src/components/landing/Footer.tsx": "Footer with a ZIP source-code download link and site copyright/attribution.",
  "frontend/src/components/landing/sections/AboutSection.tsx": "About section presenting a portrait, title, subtitle, and descriptive text about the linguistic reprogramming system.",
  "frontend/src/components/landing/sections/HeroSection.tsx": "Hero section with background imagery, headline, descriptive text, and primary/secondary CTA buttons linking to PayPal.",
  "frontend/src/components/landing/sections/MissionSection.tsx": "Mission section outlining global wellness initiatives with icons and a donation-related message.",
  "frontend/src/components/landing/sections/ProductSection.tsx": "Renders a multi-part product overview with seven sections describing concepts and tools in the 25-Word PDF Checklist. Includes icons, descriptions, and styled layout blocks.",
  "frontend/src/components/landing/sections/RevealSection.tsx": "Displays a themed section revealing how language affects biology, with examples of harmful phrases and explanatory callouts. Includes styled cards, icons, and background imagery.",
  "frontend/src/components/landing/sections/SecondVideoSection.tsx": "Wraps VideoSectionBase to render the second video using a predefined source and query parameter override.",
  "frontend/src/components/landing/sections/Sections1to7.tsx": "Provides multiple educational sections covering linguistic concepts like Try vs Execute and the Week-End myth, using graphics, callouts, and styled content blocks.",
  "frontend/src/components/landing/sections/VideoSection.tsx": "Wraps VideoSectionBase to render the primary video with default configuration and optional URL override.",
  "frontend/src/components/landing/sections/VideoSectionBase.tsx": "Handles video rendering with preflight availability checks, error states, and fallback UI. Supports query param overrides and detailed error messaging.",
  "frontend/src/components/landing/sections/VisualPerimeterSection.tsx": "Displays two downloadable printable tools (Monitor Strip and 25-Word Checklist) with descriptions and download buttons. Includes styled cards and a tip section.",
  "frontend/src/components/landing/sections/WordAwarenessResetSection.tsx": "Presents a 7‑day reset program with benefits list and a CTA button linking to PayPal. Includes decorative background elements and centered content.",
  "frontend/src/config/landing.ts": "Defines URLs, CTA labels, video sources, and download paths used throughout landing page components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout functions, and loads stored identities using AuthClient.",
  "frontend/src/hooks/useLocationSearch.ts": "Tracks URL search parameters reactively by listening to navigation and history events.",
  "frontend/src/index.css": "Defines Tailwind base styles, color tokens, themes, and utility classes for the app’s design system.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider before rendering App.",
  "frontend/src/pages/LandingPage.tsx": "Composes the landing page layout from multiple content sections and a footer with a charcoal background.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, shadows, and container settings.",
  "project_state.json": "Stores project metadata, feature definitions, issues, and new feature requests for build planning."
}