{
  "kind": "build_request",
  "title": "Provide an in-app downloadable ZIP of the full landing page project (alternative to missing Export button)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a downloadable ZIP artifact of the full project (frontend + backend) into the repository as a static file so users can download the code even when the platform UI “Download/Export code” button is not visible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Yes please do you I want you to package your full landing page code into a ZIP now?"
        ]
      },
      "acceptanceCriteria": [
        "A ZIP file containing the full project source (including both `frontend/` and `backend/`) is added under `frontend/public/assets/downloads/` (or equivalent static public directory) and is served as a static asset by the deployed site.",
        "The ZIP downloads successfully in the browser and unzips without errors.",
        "The ZIP includes the current landing page code (not an empty placeholder)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expose the ZIP download via the landing page UI by adding a clearly labeled download link/button in the site footer, and include a short one-line instruction indicating that this is the full source code download.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "I can generate a fresh ZIP of your full project right here in the chat and send it to you directly.",
          "Yes please do you I want you to package your full landing page code into a ZIP now?"
        ]
      },
      "acceptanceCriteria": [
        "The footer renders a visible control labeled in English (e.g., “Download source code (ZIP)”).",
        "Clicking the control downloads the ZIP from the static asset path added in REQ-1.",
        "The link uses safe attributes when appropriate (e.g., no navigation away from the landing page is required; if opening a new tab is used, `rel=\"noopener noreferrer\"` is set)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` or any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "Backend must remain single-actor Motoko (no additional backend services)."
  ],
  "nonGoals": [
    "Do not implement a dynamic “zip generation” feature at runtime inside the canister.",
    "Do not add new authentication flows or require Internet Identity for downloading the ZIP."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}